<?xml version="1.0" ?>
<net name="person-reidentification-retail-0248" version="10">
	<layers>
		<layer id="0" name="data" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,3,256,128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data/reverse_input_channels3263132635/Split_input_port_1/value32665_const890_const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="" size="8"/>
			<output>
				<port id="1" precision="I64"/>
			</output>
		</layer>
		<layer id="2" name="data/reverse_input_channels3263132635/Split" type="Split" version="opset1">
			<data num_splits="3"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1"/>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data/reverse_input_channels3263132635/Concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="data/reverse_input_channels3263132637/Concat32678_const895_const" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="1,3,1,1" size="6"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Mul_/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="data/reverse_input_channels32633/Concat32662_const897_const" type="Const" version="opset1">
			<data element_type="f16" offset="14" shape="1,3,1,1" size="6"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Add_/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="70177021_const" type="Const" version="opset1">
			<data element_type="f16" offset="20" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="9" name="70187022_const" type="Const" version="opset1">
			<data element_type="f16" offset="22" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="10" name="70197023_const" type="Const" version="opset1">
			<data element_type="f16" offset="20" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="11" name="70207024_const" type="Const" version="opset1">
			<data element_type="f16" offset="22" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="12" name="569/Ins_Norm/MVN_/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="569/Ins_Norm/MVN_" type="MVN" version="opset1">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="onnx_initializer_node_in_first.weight/Output_0/Data_/copy/copy_const900_const" type="Const" version="opset1">
			<data element_type="f16" offset="24" shape="1,3,1,1" size="6"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="569/Ins_Norm/mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="onnx_initializer_node_in_first.bias/Output_0/Data_/copy/copy_const902_const" type="Const" version="opset1">
			<data element_type="f16" offset="30" shape="1,3,1,1" size="6"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="569/Ins_Norm/add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="59875991_const" type="Const" version="opset1">
			<data element_type="f16" offset="36" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="19" name="59885992_const" type="Const" version="opset1">
			<data element_type="f16" offset="38" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="20" name="59895993_const" type="Const" version="opset1">
			<data element_type="f16" offset="36" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="21" name="59905994_const" type="Const" version="opset1">
			<data element_type="f16" offset="38" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="22" name="570/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="570/fq_weights_1/Convert_to_float/Cast_016359_const" type="Const" version="opset1">
			<data element_type="u8" offset="40" shape="16,3,7,7" size="2352"/>
			<output>
				<port id="1" precision="U8">
					<dim>16</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="570/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="570/fq_weights_1/Copy/out_low14268_const" type="Const" version="opset1">
			<data element_type="f16" offset="2392" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="570/fq_weights_1/Copy/out_high14269_const" type="Const" version="opset1">
			<data element_type="f16" offset="2394" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="59996003_const" type="Const" version="opset1">
			<data element_type="f16" offset="2396" shape="16,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="60006004_const" type="Const" version="opset1">
			<data element_type="f16" offset="2428" shape="16,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="570/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="570" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="3,3" pads_end="3,3" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="21322134_const" type="Const" version="opset1">
			<data element_type="f16" offset="2460" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="570/add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="46974701_const" type="Const" version="opset1">
			<data element_type="f16" offset="2492" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="34" name="46984702_const" type="Const" version="opset1">
			<data element_type="f16" offset="2494" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="35" name="46994703_const" type="Const" version="opset1">
			<data element_type="f16" offset="2492" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="36" name="47004704_const" type="Const" version="opset1">
			<data element_type="f16" offset="2494" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="37" name="571/Ins_Norm/MVN_/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="571/Ins_Norm/MVN_" type="MVN" version="opset1">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="onnx_initializer_node_conv1.bn.weight/Output_0/Data_/copy/copy_const907_const" type="Const" version="opset1">
			<data element_type="f16" offset="2496" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="571/Ins_Norm/mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="onnx_initializer_node_conv1.bn.bias/Output_0/Data_/copy/copy_const909_const" type="Const" version="opset1">
			<data element_type="f16" offset="2528" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="571/Ins_Norm/add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="572" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="93409344_const" type="Const" version="opset1">
			<data element_type="f16" offset="2560" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="45" name="93419345_const" type="Const" version="opset1">
			<data element_type="f16" offset="2562" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="46" name="93429346_const" type="Const" version="opset1">
			<data element_type="f16" offset="2560" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="47" name="93439347_const" type="Const" version="opset1">
			<data element_type="f16" offset="2562" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="48" name="573/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="573" type="MaxPool" version="opset1">
			<data kernel="3,3" pads_begin="1,1" pads_end="1,1" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="574/fq_weights_1/Convert_to_float/Cast_016309_const" type="Const" version="opset1">
			<data element_type="u8" offset="2564" shape="16,16,1,1" size="256"/>
			<output>
				<port id="1" precision="U8">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="574/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="574/fq_weights_1/Copy/out_low13980_const" type="Const" version="opset1">
			<data element_type="f16" offset="2820" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="574/fq_weights_1/Copy/out_high13981_const" type="Const" version="opset1">
			<data element_type="f16" offset="2394" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="65296533_const" type="Const" version="opset1">
			<data element_type="f16" offset="2822" shape="16,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="65306534_const" type="Const" version="opset1">
			<data element_type="f16" offset="2854" shape="16,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="574/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="574" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="data_add_1967119676/copy_const915_const" type="Const" version="opset1">
			<data element_type="f16" offset="2886" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="575/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="576" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="71977201_const" type="Const" version="opset1">
			<data element_type="f16" offset="2918" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="62" name="71987202_const" type="Const" version="opset1">
			<data element_type="f16" offset="2920" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="63" name="71997203_const" type="Const" version="opset1">
			<data element_type="f16" offset="2918" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="64" name="72007204_const" type="Const" version="opset1">
			<data element_type="f16" offset="2920" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="65" name="577/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="577/fq_weights_1/Convert_to_float/Cast_016433_const" type="Const" version="opset1">
			<data element_type="u8" offset="2922" shape="16,16,1,1" size="256"/>
			<output>
				<port id="1" precision="U8">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="577/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="577/fq_weights_1/Copy/out_low14100_const" type="Const" version="opset1">
			<data element_type="f16" offset="3178" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="577/fq_weights_1/Copy/out_high14101_const" type="Const" version="opset1">
			<data element_type="f16" offset="2394" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="72097213_const" type="Const" version="opset1">
			<data element_type="f16" offset="3180" shape="16,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="72107214_const" type="Const" version="opset1">
			<data element_type="f16" offset="3212" shape="16,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="577/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="577" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="21362138_const" type="Const" version="opset1">
			<data element_type="f16" offset="3244" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="577/add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="54475451_const" type="Const" version="opset1">
			<data element_type="f16" offset="3276" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="54485452_const" type="Const" version="opset1">
			<data element_type="f16" offset="3308" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="54495453_const" type="Const" version="opset1">
			<data element_type="f16" offset="3276" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="54505454_const" type="Const" version="opset1">
			<data element_type="f16" offset="3308" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="578/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="578/fq_weights_1/Convert_to_float/Cast_016499_const" type="Const" version="opset1">
			<data element_type="u8" offset="3340" shape="16,1,3,3" size="144"/>
			<output>
				<port id="1" precision="U8">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="578/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="578/fq_weights_1/Copy/out_low13852_const" type="Const" version="opset1">
			<data element_type="f16" offset="3178" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="578/fq_weights_1/Copy/out_high13853_const" type="Const" version="opset1">
			<data element_type="f16" offset="2394" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="54595463_const" type="Const" version="opset1">
			<data element_type="f16" offset="3484" shape="16,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="54605464_const" type="Const" version="opset1">
			<data element_type="f16" offset="3516" shape="16,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="578/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="18627/value18629_const" type="Const" version="opset1">
			<data element_type="i64" offset="3548" shape="5" size="40"/>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="18627" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="578" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="data_add_1975119756/copy_const922_const" type="Const" version="opset1">
			<data element_type="f16" offset="3588" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="579/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="580" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="50675071_const" type="Const" version="opset1">
			<data element_type="f16" offset="3620" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="95" name="50685072_const" type="Const" version="opset1">
			<data element_type="f16" offset="3622" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="96" name="50695073_const" type="Const" version="opset1">
			<data element_type="f16" offset="3620" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="97" name="50705074_const" type="Const" version="opset1">
			<data element_type="f16" offset="3622" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="98" name="617/reduce/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="617/reduce/Cast_116429_const" type="Const" version="opset1">
			<data element_type="i64" offset="3624" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="617/reduce" type="ReduceMean" version="opset1">
			<data keep_dims="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Copy_onnx_initializer_node_conv2.0.gate.fc1.weight/Output_0/Data__const927_const" type="Const" version="opset1">
			<data element_type="f16" offset="3640" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="618/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="618/Dims11974/copy_const929_const" type="Const" version="opset1">
			<data element_type="f16" offset="3672" shape="1,1,1,1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="618" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="619" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Copy_onnx_initializer_node_conv2.0.gate.fc2.weight/Output_0/Data__const932_const" type="Const" version="opset1">
			<data element_type="f16" offset="3674" shape="16,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="620/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="620/Dims12046/copy_const934_const" type="Const" version="opset1">
			<data element_type="f16" offset="3706" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="620" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="621" type="Sigmoid" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="60176021_const" type="Const" version="opset1">
			<data element_type="f16" offset="3620" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="112" name="60186022_const" type="Const" version="opset1">
			<data element_type="f16" offset="3738" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="113" name="60196023_const" type="Const" version="opset1">
			<data element_type="f16" offset="3620" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="114" name="60206024_const" type="Const" version="opset1">
			<data element_type="f16" offset="3738" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="115" name="622/fq_input_1" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="622" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="63176321_const" type="Const" version="opset1">
			<data element_type="f16" offset="3620" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="118" name="63186322_const" type="Const" version="opset1">
			<data element_type="f16" offset="3740" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="119" name="63196323_const" type="Const" version="opset1">
			<data element_type="f16" offset="3620" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="120" name="63206324_const" type="Const" version="opset1">
			<data element_type="f16" offset="3740" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="121" name="629/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="581/fq_weights_1/Convert_to_float/Cast_016347_const" type="Const" version="opset1">
			<data element_type="u8" offset="3742" shape="16,16,1,1" size="256"/>
			<output>
				<port id="1" precision="U8">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="581/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="581/fq_weights_1/Copy/out_low14300_const" type="Const" version="opset1">
			<data element_type="f16" offset="3998" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="581/fq_weights_1/Copy/out_high14301_const" type="Const" version="opset1">
			<data element_type="f16" offset="2394" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="53395343_const" type="Const" version="opset1">
			<data element_type="f16" offset="4000" shape="16,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="53405344_const" type="Const" version="opset1">
			<data element_type="f16" offset="4032" shape="16,1,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="581/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="581" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="21402142_const" type="Const" version="opset1">
			<data element_type="f16" offset="4064" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="581/add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="39273931_const" type="Const" version="opset1">
			<data element_type="f16" offset="4096" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="39283932_const" type="Const" version="opset1">
			<data element_type="f16" offset="4128" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="39293933_const" type="Const" version="opset1">
			<data element_type="f16" offset="4096" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="39303934_const" type="Const" version="opset1">
			<data element_type="f16" offset="4128" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="582/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="582/fq_weights_1/Convert_to_float/Cast_016373_const" type="Const" version="opset1">
			<data element_type="u8" offset="4160" shape="16,1,3,3" size="144"/>
			<output>
				<port id="1" precision="U8">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="582/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="582/fq_weights_1/Copy/out_low14340_const" type="Const" version="opset1">
			<data element_type="f16" offset="3998" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="582/fq_weights_1/Copy/out_high14341_const" type="Const" version="opset1">
			<data element_type="f16" offset="2394" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="39393943_const" type="Const" version="opset1">
			<data element_type="f16" offset="4304" shape="16,1,1,1" size="32"/>
